Repository: Mynnts/KID_Guard_App
Catalog: lib/l10n/app_*.arb
Languages: th

source: Good Morning
th: สวัสดีตอนเช้า

source: Good Afternoon
th: สวัสดีตอนบ่าย

source: Good Evening
th: สวัสดีตอนเย็น

source: My Children
th: ลูกหลานของฉัน

source: Add Child
th: เพิ่มลูกหลาน

source: See All
th: ดูทั้งหมด

source: Quick Actions
th: เมนูด่วน

source: Notifications
th: การแจ้งเตือน

source: Profile
th: โปรไฟล์

source: Settings
th: การตั้งค่า

source: Language
th: ภาษา

source: Appearance
th: การแสดงผล

# appearanceSubtitle
source: Theme & colors
th: ธีมและสี

source: Connection
th: การเชื่อมต่อ

source: General
th: ทั่วไป

source: Support
th: ช่วยเหลือ

source: Account
th: บัญชี

source: Help Center
th: ศูนย์ช่วยเหลือ

source: Send Feedback
th: ส่งข้อเสนอแนะ

source: About
th: เกี่ยวกับ

source: Sign Out
th: ออกจากระบบ

source: Points
th: แต้ม

source: Quick Add
th: เพิ่มแต้มด่วน

source: Redeem Rewards
th: แลกของรางวัล

source: Point History
th: ประวัติแต้ม

# noActivity
source: No activity today
th: ไม่มีกิจกรรมในวันนี้

source: Homework
th: การบ้าน

source: Chores
th: งานบ้าน

source: Good Behavior
th: ความประพฤติดี

source: Exercise
th: ออกกำลังกาย

source: Ice Cream
th: ไอศกรีม

source: Game Time
th: เวลาเล่นเกม

source: Movie
th: ดูหนัง

source: New Toy
th: ของเล่นใหม่

# stayUp
source: Stay Up Late
th: นอนดึกได้

source: Park Trip
th: ไปสวนสาธารณะ

# needMorePoints
source: Need {amount} more points
th: ต้องการอีก {amount} แต้ม

source: Redeem
th: แลก

source: Cancel
th: ยกเลิก

# redeemConfirm
source: Redeem {reward}?
th: แลก {reward}?

# redeemCost
source: Use {cost} points
th: ใช้ {cost} แต้ม

source: Redeem Now
th: แลกเลย

source: Success!
th: สำเร็จ!

# earnedReward
source: {child} earned {reward}
th: {child} ได้รับ {reward}

source: Close
th: ปิด

# pointsEarned
source: +{amount} points for {reason}
th: +{amount} แต้ม สำหรับ {reason}

# redeemed
source: Redeemed: {reward}
th: แลก: {reward}

source: Edit Child Profile
th: แก้ไขโปรไฟล์บุตรหลาน

source: Add Child Profile
th: เพิ่มโปรไฟล์บุตรหลาน

# updateProfileDesc
source: Update your child's profile settings.
th: อัปเดตการตั้งค่าโปรไฟล์ของบุตรหลาน

# createProfileDesc
source: Create a profile for your child to manage their device usage.
th: สร้างโปรไฟล์เพื่อจัดการการใช้งานอุปกรณ์

# childName
source: Child's Name
th: ชื่อบุตรหลาน

# childAge
source: Age
th: อายุ

source: Daily Time Limit
th: จำกัดเวลาต่อวัน

source: Unlimited
th: ไม่จำกัด

source: hours
th: ชั่วโมง

source: Select Mode
th: เลือกโหมด

source: Strict Mode
th: โหมดเข้มงวด

# strictModeDesc
source: Block all apps except allowed ones.
th: บล็อกทุกแอพยกเว้นที่อนุญาต

source: Flexible Mode
th: โหมดยืดหยุ่น

# flexibleModeDesc
source: Allow all apps except blocked ones.
th: อนุญาตทุกแอพยกเว้นที่บล็อก

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Create Profile
th: สร้างโปรไฟล์

# fillAllFields
source: Please fill in all fields
th: กรุณากรอกข้อมูลให้ครบถ้วน

# enterValidAge
source: Please enter a valid age
th: กรุณากรอกอายุที่ถูกต้อง

# profileUpdated
source: Profile updated successfully!
th: อัปเดตโปรไฟล์เรียบร้อยแล้ว!

# profileCreated
source: Profile for {name} created successfully!
th: สร้างโปรไฟล์สำหรับ {name} เรียบร้อยแล้ว!

# errorSavingProfile
source: Error saving profile: {error}
th: เกิดข้อผิดพลาดในการบันทึก: {error}

# accountProfile
source: My Account
th: บัญชีของฉัน

source: Display Name
th: ชื่อที่แสดง

# displayNameDesc
source: Name to be displayed in app
th: ชื่อที่จะแสดงในแอป

source: Email
th: อีเมล

source: Cannot be changed
th: ไม่สามารถเปลี่ยนได้

source: Verified
th: ยืนยันแล้ว

source: Password
th: รหัสผ่าน

# changePasswordDesc
source: Change your password
th: เปลี่ยนรหัสผ่านของคุณ

source: Change
th: เปลี่ยน

source: Current Password
th: รหัสผ่านปัจจุบัน

source: New Password
th: รหัสผ่านใหม่

source: Confirm New Password
th: ยืนยันรหัสผ่านใหม่

source: Save
th: บันทึก

source: Not set
th: ยังไม่ได้ตั้งชื่อ

# enterDisplayName
source: Please enter display name
th: กรุณากรอกชื่อที่แสดง

# nameLengthError
source: Name must be at least 2 characters
th: ชื่อต้องมีอย่างน้อย 2 ตัวอักษร

# displayNameChanged
source: Your display name has been changed to "{name}".
th: ชื่อที่แสดงของคุณเปลี่ยนเป็น "{name}".

# updateSuccess
source: Update successful
th: อัปเดตเรียบร้อยแล้ว

# updateError
source: An error occurred, please try again
th: เกิดข้อผิดพลาด กรุณาลองใหม่

# enterCurrentPassword
source: Please enter current password
th: กรุณากรอกรหัสผ่านปัจจุบัน

# passwordLengthError
source: New password must be at least 6 characters
th: รหัสผ่านใหม่ต้องมีอย่างน้อย 6 ตัวอักษร

# passwordMismatchError
source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: Security Alert
th: แจ้งเตือนความปลอดภัย

# passwordChangedSuccess
source: Your password was changed successfully.
th: เปลี่ยนรหัสผ่านเรียบร้อยแล้ว

# passwordChangeSuccessMsg
source: Password changed successfully
th: เปลี่ยนรหัสผ่านเรียบร้อยแล้ว

source: Current password incorrect
th: รหัสผ่านปัจจุบันไม่ถูกต้อง

source: Parent Account
th: บัญชีผู้ปกครอง

source: Edit
th: แก้ไข

# childAddedTitle
source: Child Added
th: เพิ่มบุตรหลานแล้ว

# childAddedMessage
source: {name} has been added to your family.
th: เพิ่ม {name} เข้ามาในครอบครัวของคุณแล้ว

# profileUpdatedTitle
source: Profile Updated
th: อัปเดตโปรไฟล์แล้ว

# profileUpdatedMessage
source: {name}'s profile has been updated.
th: โปรไฟล์ของ {name} ได้รับการอัปเดตเรียบร้อยแล้ว
